; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph4 - mode
	thermograph5 - mode
	spectrograph3 - mode
	infrared1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(pointing satellite1 Star4)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon9 spectrograph3)
	(have_image Star10 thermograph4)
	(have_image Star10 thermograph5)
	(have_image Planet11 thermograph5)
	(have_image Planet11 infrared1)
	(have_image Planet12 infrared2)
	(have_image Planet13 thermograph4)
	(have_image Planet13 infrared1)
	(have_image Star14 thermograph4)
	(have_image Planet15 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation5 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 13
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite1 planet15 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet15)
   goals met: 0 of 13
5. (take_image satellite1 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 1 of 13
6. (turn_to satellite1 planet13 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet13)
   goals met: 1 of 13
7. (take_image satellite1 planet13 instrument1 thermograph4)
   added: (have_image planet13 thermograph4)
   goals met: 2 of 13
8. (turn_to satellite1 planet11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet11)
   goals met: 2 of 13
9. (turn_to satellite0 star3 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star3)
   goals met: 2 of 13
10. (take_image satellite1 planet11 instrument1 thermograph5)
   added: (have_image planet11 thermograph5)
   goals met: 3 of 13
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 13
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 3 of 13
13. (turn_to satellite0 phenomenon9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 13
14. (take_image satellite0 phenomenon9 instrument0 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 4 of 13
15. (take_image satellite0 phenomenon9 instrument0 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 5 of 13
16. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 5 of 13
17. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 6 of 13
18. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 13
19. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 7 of 13
20. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 7 of 13
21. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 8 of 13
22. (turn_to satellite1 star10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star10)
   goals met: 8 of 13
23. (take_image satellite1 star10 instrument1 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 9 of 13
24. (take_image satellite1 star10 instrument1 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 10 of 13
25. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 10 of 13
26. (take_image satellite1 star14 instrument1 thermograph4)
   added: (have_image star14 thermograph4)
   goals met: 11 of 13
27. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 11 of 13
28. (take_image satellite1 star8 instrument1 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 12 of 13
29. (turn_to satellite1 star4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star4)
   goals met: 13 of 13
